dropFormation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1e-05/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    axis
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          150;
        startFace       14170;
    }
    outwall
    {
        type            patch;
        nFaces          150;
        startFace       14320;
    }
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       14470;
    }
    inwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       14480;
    }
    atmosphere
    {
        type            patch;
        nFaces          80;
        startFace       14550;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       14630;
    }
    frontAndBackPlanes_pos
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7200;
        startFace       14630;
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7200;
        startFace       21830;
    }
)

// ************************************************************************* //
