dropFormation/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            fixedValue;
        value           uniform 0;
    }

    inwall
    {
        type            fixedFluxPressure;
    }

    outwall
    {
        type            fixedFluxPressure;
    }

    defaultFaces
    {
        type            empty;
    }
     
frontAndBackPlanes
    {
        type            empty;
       
    }
    frontAndBackPlanes_pos
    {
        type            wedge;
       
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
       
    } 
   axis
    {
        type            symmetryPlane;
        
    }


}


// ************************************************************************* //
